import streamlit as st

# Title of the app\
st.markdown("<h2 style='text-align: center; color: white;'>🚗ميزانيتي محدودة وادور سيار كشخه  </h2>", unsafe_allow_html=True)




# Display selected filters
st.subheader(f"ليلى لم تكن تشتري سيارة فقط ،كانت تشتري فرصة للاستقلالية . كانت سيارة تويوتا كورولا 2015 التي أمامها أكثر من مجرد سيارة مستعملة، كانت طريقها للاستقلالية والاعتماد على نفسها ،والتخلص  من سيارات الأجرة والجداول الزمنية الغير منتظمة للحافلات التي كانت دائمًا تفسد خططها. مع ميزانية محدودة، كانت تعرف أن هذه السيارة يجب أن تكون جيدة.")

# Placeholder for images (You can uncomment and add images later)
st.image(r"first.png", caption="Car 1")

st.subheader("لقد سافرت إلى الرياض، عارفة أن لديها أكبر سوق للسيارات المستعملة في المنطقة كانت هذه أفضل فرصة لها للعثور على سيارة جيده ضمن ميزانيتها المحدودة.")
st.image(r"2.jpg")
# st.image("path_to_image2.jpg", caption="Car 2")
st.subheader("وقد تم تصفية البحث بالفعل تلقائيًا لها:سيارات أوتوماتيكية، ومتوفرة في الرياض.")
st.image(r"mroe.jpg")

# Section 5: Graph 4

st.subheader("بفضل منصة إلكترونية اكتشفتها، تم تصفية بحثها تلقائيًا: سيارات ضمن ميزانيتها، متوفرة في الرياض. ")
st.image(r"Full_year.jpg")

st.subheader("بعد ذلك تم تصفيه بحثها مزودة بالميزات التي تحتاجها( نوع فل ، تكون إصدار 2020 وفوق)")

